let quizzes = [
  {
    "題目": "我很容易莫名其妙地生氣",
    "正面負面": "negative",
    "向度": "A"
  },
  {
    "題目": "我會因為別人的話感到生氣",
    "正面負面": "negative",
    "向度": "A"
  },
  {
    "題目": "我常常會煩惱事情",
    "正面負面": "negative",
    "向度": "A"
  },
  {
    "題目": "我覺得生活很無趣",
    "正面負面": "negative",
    "向度": "A"
  },
  {
    "題目": "跟別人聊天，我能夠得到樂趣",
    "正面負面": "positive",
    "向度": "A"
  },
  {
    "題目": "我能夠持之以恆地把事情完成",
    "正面負面": "positive",
    "向度": "A"
  },
  {
    "題目": "我覺得老師很關心我",
    "正面負面": "positive",
    "向度": "A"
  },
  {
    "題目": "我覺得家人很關心我",
    "正面負面": "positive",
    "向度": "A"
  },
  {
    "題目": "我覺得家人是可以信任的",
    "正面負面": "positive",
    "向度": "A"
  },
  {
    "題目": "我覺得老師說的話都是為我好",
    "正面負面": "positive",
    "向度": "A"
  },
  {
    "題目": "我對自己的表現感到滿意",
    "正面負面": "positive",
    "向度": "A"
  },
  {
    "題目": "我不喜歡跟同學相處",
    "正面負面": "negative",
    "向度": "B"
  },
  {
    "題目": "我覺得生活中充滿了困難",
    "正面負面": "negative",
    "向度": "B"
  },
  {
    "題目": "我覺得自己的生活很糟糕",
    "正面負面": "negative",
    "向度": "B"
  },
  {
    "題目": "我常常覺得睡不飽",
    "正面負面": "negative",
    "向度": "B"
  },
  {
    "題目": "我常常覺得不開心",
    "正面負面": "negative",
    "向度": "B"
  },
  {
    "題目": "我喜歡幫助有困難的人",
    "正面負面": "positive",
    "向度": "B"
  },
  {
    "題目": "我喜歡主動去認識新朋友",
    "正面負面": "positive",
    "向度": "B"
  },
  {
    "題目": "我會盡力完成分配給我的事情",
    "正面負面": "positive",
    "向度": "B"
  },
  {
    "題目": "我能夠和別人愉快地相處",
    "正面負面": "positive",
    "向度": "B"
  },
  {
    "題目": "我喜歡與別人聊天",
    "正面負面": "positive",
    "向度": "B"
  },
  {
    "題目": "我喜歡幫助有困難的同學",
    "正面負面": "positive",
    "向度": "B"
  },
  {
    "題目": "我跟同學相處得很開心",
    "正面負面": "positive",
    "向度": "B"
  },
  {
    "題目": "我對自己的表現有信心",
    "正面負面": "positive",
    "向度": "B"
  },
  {
    "題目": "我覺得現在的生活很快樂",
    "正面負面": "positive",
    "向度": "B"
  },
  {
    "題目": "我覺得自己的健康狀態很好",
    "正面負面": "positive",
    "向度": "B"
  },
  {
    "題目": "我覺得心理的壓力很大",
    "正面負面": "negative",
    "向度": "C"
  },
  {
    "題目": "我常常覺得好疲倦",
    "正面負面": "negative",
    "向度": "C"
  },
  {
    "題目": "我喜歡和別人一起玩遊戲",
    "正面負面": "positive",
    "向度": "C"
  },
  {
    "題目": "我喜歡跟同學一起合作來完成事情",
    "正面負面": "positive",
    "向度": "C"
  },
  {
    "題目": "我喜歡嘗試新事物",
    "正面負面": "positive",
    "向度": "C"
  },
  {
    "題目": "我覺得自己是個活潑的人",
    "正面負面": "positive",
    "向度": "C"
  },
  {
    "題目": "我喜歡跟老師接觸",
    "正面負面": "positive",
    "向度": "C"
  },
  {
    "題目": "我有困難的時候家人會幫助我",
    "正面負面": "positive",
    "向度": "C"
  },
  {
    "題目": "我覺得自己是個很棒的人",
    "正面負面": "positive",
    "向度": "C"
  },
  {
    "題目": "我能夠改進自己的缺點",
    "正面負面": "positive",
    "向度": "C"
  },
  {
    "題目": "我會欣賞自己的優點",
    "正面負面": "positive",
    "向度": "C"
  },
  {
    "題目": "我覺得生活很充實",
    "正面負面": "positive",
    "向度": "C"
  },
  {
    "題目": "我不敢接近老師",
    "正面負面": "negative",
    "向度": "D"
  },
  {
    "題目": "看到老師我會躲地遠遠地",
    "正面負面": "negative",
    "向度": "D"
  },
  {
    "題目": "我會控制自己的脾氣",
    "正面負面": "positive",
    "向度": "D"
  },
  {
    "題目": "我喜歡跟家人聊天",
    "正面負面": "positive",
    "向度": "D"
  },
  {
    "題目": "與家人聊天時，我有被關心的感覺",
    "正面負面": "positive",
    "向度": "D"
  },
  {
    "題目": "我喜歡現在的生活",
    "正面負面": "positive",
    "向度": "D"
  },
  {
    "題目": "我覺得自己很有活力",
    "正面負面": "positive",
    "向度": "D"
  },
  {
    "題目": "事情失敗後，我還會想其他方法來解決",
    "正面負面": "positive",
    "向度": "D"
  },
  {
    "題目": "我喜歡了解自己不懂的事情",
    "正面負面": "positive",
    "向度": "D"
  },
  {
    "題目": "我容易為了小事情而不開心",
    "正面負面": "negative",
    "向度": "E"
  },
  {
    "題目": "我對新事物一點興趣也沒有",
    "正面負面": "negative",
    "向度": "E"
  },
  {
    "題目": "我會尊重別人不同的意見",
    "正面負面": "positive",
    "向度": "E"
  },
  {
    "題目": "我喜歡動腦筋思考問題",
    "正面負面": "positive",
    "向度": "E"
  },
  {
    "題目": "我難過的時候，同學會安慰我",
    "正面負面": "positive",
    "向度": "E"
  },
  {
    "題目": "我覺得老師是可以信任的",
    "正面負面": "positive",
    "向度": "E"
  },
  {
    "題目": "我覺得家人很了解我的個性",
    "正面負面": "positive",
    "向度": "E"
  },
  {
    "題目": "跟同學聊天時，我有被關心的感覺",
    "正面負面": "positive",
    "向度": "E"
  },
  {
    "題目": "我喜歡和同學一起玩",
    "正面負面": "positive",
    "向度": "E"
  },
  {
    "題目": "同學難過的時候，我會去安慰她",
    "正面負面": "positive",
    "向度": "E"
  },
  {
    "題目": "我不會為了小事情發脾氣",
    "正面負面": "positive",
    "向度": "E"
  },
  {
    "題目": "用過的東西我會排放整齊",
    "正面負面": "positive",
    "向度": "E"
  }
 ];