let labels, labelSet, score_background;
function csv2json(csv){
  var lines=csv.split("\n");
  var result = [];
  var headers=lines[0].split(/(\s+)/).filter( function(e) { return e.trim().length > 0; } );
  for(var i=1;i<lines.length-1;i++){

	  var obj = {};
	  var currentline=lines[i].split(/(\s+)/).filter( function(e) { return e.trim().length > 0; } );
	  for(var j=0;j<headers.length;j++){
		  obj[headers[j]] = currentline[j];
	  }
	  result.push(obj);
  }  
  //return result; //JavaScript object
  //return JSON.stringify(result); //JSON
  return result
}
function analyzeSummary(){
  let summaryScore = []
  summaryScore.push(calculateWeek(0));
  summaryScore.push(calculateWeek(4));
  let cur_labels = labels;
  analyzeInitial();
  labels = cur_labels;
  // For each student
  for(let i=0; i<summaryScore[0].length; i++){    
    let cur_student = $("#student_container_template").clone()
    cur_student.attr("id", "student_container_" + summaryScore[0][i]["studentID"]);
    let cur_score_all = [];
    // For each answer
    for (let j=0; j<cur_labels.length; j++) {
      let cur_score_weighted = summaryScore[0][i][cur_labels[j]]*0.6 + summaryScore[1][i][cur_labels[j]]*0.4
      cur_score_all.push(cur_score_weighted)
    }
    // Generate Text from score   
    let teacher_review = ""    
    function judgeText(input_score){   
      let review_text = ""
      let review_class = ""
      if(input_score > 3){
        review_text = "良好";
        review_class = "review_blue";
      }else if(input_score > 2){
        review_text = "尚可";
        review_class = "review_green";
      }else{
        review_text = "危險";
        review_class = "review_red";
      }
      return [review_class, review_text];
    }
    // Generate whole description
    for(let j=0; j<labels.length; j++){
      let review_return;
      review_return = judgeText(cur_score_all[j]);
      teacher_review += labels[j] + ":<span class="+ review_return[0] +">";
      teacher_review += review_return[1];
      if(j!=labels.length-1){
        teacher_review += "</span>，";
      }
      else{
        teacher_review += "</span>。";
      }
    } 
    cur_student.find(".review").html(teacher_review);
    // Edit A4
    cur_student.find(".student_id").text(summaryScore[0][i]["studentName"])
    cur_student.find(".chart_container canvas").attr("id", "canvas_" + summaryScore[0][i]["studentID"]);
    cur_student.appendTo($("#students_container"));     
    // Canvas Radar
    drawChart(summaryScore[0][i]["studentID"], cur_score_all)
    // Canvas SkillBar
    drawChart2(cur_student, summaryScore[0][i]["studentID"], cur_score_all)
    if(document.getElementById("radio_chart_radar").checked) {        
      // Canvas Radar
      cur_student.find(".a4-chart").show();
      cur_student.find(".a4-chart2").hide();
    }
    else if(document.getElementById("radio_chart_skillBar").checked){
      // Canvas SkillBar
      cur_student.find(".a4-chart2").show();
      cur_student.find(".a4-chart").hide();
    }
  }
  // Success
  $("#execution-msg").show();
  $("#execution-msg-correct").show();
  $("#execution-msg-wrong").hide();
  $("#execution-msg-event").text('老師學生加權綜合評量');
}
function selectChart(chart_type){
  if(chart_type=="radar"){
    $(".a4-chart").show();
    $(".a4-chart2").hide();
  }
  else if(chart_type=="skillBar"){
    $(".a4-chart2").show();
    $(".a4-chart").hide();
  }
}
function drawChart(score_id, cur_score_all){  
  let canvas = document.getElementById("canvas_" + score_id);
  let ctx = canvas.getContext('2d');
  let chart = new Chart(ctx, {
      type: 'radar',    
      data: {
          labels: labels,
          datasets: [{
              backgroundColor: 'rgba(255, 99, 132, 0.5)',
              borderColor: 'rgb(255, 99, 132)',
              pointBorderColor: 'rgb(255, 99, 132)',
              pointBackgroundColor: 'rgb(255, 99, 132)',
              data: cur_score_all,
          },{
            borderColor: 'rgba(255, 255, 255, 0)',
            backgroundColor: 'rgba(255, 255, 255, 0)',
            pointRadius: 0,
            data: score_background,
        }]
      },    
      // Configuration options go here
      options: {
        scale: {
          display: 10
        },
        legend: {
            display: false,
        }
      }
  });
}
function drawChart2(cur_student, score_id, cur_score_all){  
  for(let i=0; i<cur_score_all.length; i++){        
    let cur_skillBar_img = $("#a4-skill-template").clone()
    cur_skillBar_img.attr("id", score_id + "_skillBar_img_" + i);
    cur_skillBar_img.find(".a4-skillBar").css("height", ((1 - cur_score_all[i]/4) * 100 + 25) + "%")
    cur_student.find(".a4-skillbar-imgs").append(cur_skillBar_img);

    let cur_skillBar_name = document.createElement("th");  
    cur_skillBar_name.innerHTML = labels[i]
    cur_student.find(".a4-skillbar-names").append(cur_skillBar_name);
  }
}
function analyze(quizzes, score, week){
  // For each student 
  let all_score_all = []
  for(let i = 0; i < score.length; i++){
    let cur_student = $("#student_container_template").clone()
    cur_student.attr("id", "student_container_" + score[i]["學號"]);
    let cur_score_all = [];
    let cur_score_obj = {'studentName':score[i]["姓名"], 'studentID':score[i]["學號"]}
    // For each answer (in one student response)
    for(let j = 0; j < quizzes.length; j++){
      let cur_score = score[i][quizzes[j]["題目"]]    
      if(quizzes[j]["正面負面"] == "negative"){
        cur_score = 5 - cur_score;
      }
      if(cur_score_obj[quizzes[j]["向度"]]==undefined){
        cur_score_obj[quizzes[j]["向度"]] = parseInt(cur_score);
      }
      else{
        cur_score_obj[quizzes[j]["向度"]] = parseInt(cur_score_obj[quizzes[j]["向度"]]) + parseInt(cur_score);  
      }  
    }   
    // FIX 3 QUIZZES PER FIELD
    for (let i=0; i<labels.length; i++) {
      cur_score_obj[labels[i]] = (cur_score_obj[labels[i]] / 3 ) 
    }   
    // PUT IN
    for (let i=0; i<labels.length; i++) {
      cur_score_all.push(cur_score_obj[labels[i]])
    }
    // Generate Text from score   
    let teacher_review = ""    
    function judgeText(input_score){   
      let review_text = ""
      let review_class = ""
      if(input_score > 3){
        review_text = "良好";
        review_class = "review_blue";
      }else if(input_score > 2){
        review_text = "尚可";
        review_class = "review_green";
      }else{
        review_text = "危險";
        review_class = "review_red";
      }
      return [review_class, review_text];
    }
    // Generate whole description
    for(let j=0; j<labels.length; j++){
      let review_return;
      review_return = judgeText(cur_score_all[j]);
      teacher_review += labels[j] + ":<span class="+ review_return[0] +">";
      teacher_review += review_return[1];
      if(j!=labels.length-1){
        teacher_review += "</span>，";
      }
      else{
        teacher_review += "</span>。";
      }
    } 
    cur_student.find(".review").html(teacher_review);
    
    // Edit A4
    cur_student.find(".student_id").text(score[i]["姓名"])
    cur_student.find(".chart_container canvas").attr("id", "canvas_" + score[i]["學號"]);
    cur_student.appendTo($("#students_container"));     
    // Canvas Radar
    //drawChart(score[i]["學號"], cur_score_all)
    // Canvas SkillBar
    drawChart2(cur_student, score[i]["學號"], cur_score_all)
    if(document.getElementById("radio_chart_radar").checked) {        
      // Canvas Radar
      //drawChart(score[i]["學號"], cur_score_all)
      cur_student.find(".a4-chart").show();
      cur_student.find(".a4-chart2").hide();
    }
    else if(document.getElementById("radio_chart_skillBar").checked){
      // Canvas SkillBar
      //drawChart2(cur_student, score[i]["學號"], cur_score_all)
      cur_student.find(".a4-chart2").show();
      cur_student.find(".a4-chart").hide();
    }

    all_score_all.push(cur_score_obj);
  }
  // Success
  $("#execution-msg").show();
  $("#execution-msg-correct").show();
  $("#execution-msg-wrong").hide();
  if (week==0){
    $("#execution-msg-event").text('老師他評');
  }
  else if(week==4){
    $("#execution-msg-event").text('學生自評');
  }
  return all_score_all;
}
function quizAnalyze(quizzes){
  labels = [];
  for(let i=0; i<quizzes.length; i++){
    if(i%3 == 0){
      labels.push(quizzes[i]["向度"])
    }
    let quiz_element = $("<span></span>").text(quizzes[i]["題目"]).addClass("px-2"); 
    if(quizzes[i]["正面負面"] == "negative"){
      quiz_element.addClass("review_red")
    }
    if(quizzes[i]["向度"] == "主觀幸福"){
      $("#quiz_type1").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }
    else if(quizzes[i]["向度"] == "生活壓力"){
      $("#quiz_type2").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }
    else if(quizzes[i]["向度"] == "自我反省"){
      $("#quiz_type3").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }
    else if(quizzes[i]["向度"] == "自我接納"){
      $("#quiz_type4").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }
    else if(quizzes[i]["向度"] == "自我情緒察覺"){
      $("#quiz_type5").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }     
    else if(quizzes[i]["向度"] == "壓力抒發"){
      $("#quiz_type6").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }   
    else if(quizzes[i]["向度"] == "自我激勵"){
      $("#quiz_type7").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }   
    else if(quizzes[i]["向度"] == "參照經驗"){
      $("#quiz_type8").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }       
    else if(quizzes[i]["向度"] == "情緒管理"){
      $("#quiz_type9").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }  
    else if(quizzes[i]["向度"] == "同理他人"){
      $("#quiz_type10").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }  
    else if(quizzes[i]["向度"] == "同儕相處"){
      $("#quiz_type11").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }  
    else if(quizzes[i]["向度"] == "同儕合作"){
      $("#quiz_type12").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }  
    else if(quizzes[i]["向度"] == "衝突處理"){
      $("#quiz_type13").append(quiz_element)
      labelSet.add(quizzes[i]["向度"])    
    }  
    else{
      labelSet.add(quizzes[i]["向度"])    
    }  
  }
  //labels = Array.from(labelSet)
  //labels.sort();
  // Score background for canvas
  score_background = [5]
  for (let i=1; i<labels.length; i++){
    score_background.push(0)
  }
}
function analyzeInitial(){
  labels = [];
  labelSet = new Set();
  $("#execution-msg").hide();
  $("#students_container").children().remove();
  $(".quiz-preview-area").children().remove();
}
function calculateWeek(week_number){  
  analyzeInitial();
  let quizzes_text, quizzes, score_text, score;
  try{
    quizzes_text = document.getElementById("week"+String(week_number)+"_quiz").value;
    quizzes = JSON.parse(quizzes_text);
    //quizzes = csv2json(quizzes_text);   
    score_text = document.getElementById("week"+String(week_number)+"_score").value;
    score = JSON.parse(score_text);
    //score = csv2json(score_text);
  }
  catch(SyntaxError){    
    $("#execution-msg").show();
    $("#execution-msg-correct").hide();
    $("#execution-msg-wrong").show();
    console.log('err in function calculateWeek()')
    return;
  }
  quizAnalyze(quizzes);
  let all_score_all;
  all_score_all = analyze(quizzes, score, week_number);
  return all_score_all;
}
function inputText(selectNum){
  analyzeInitial();
  if(selectNum == 0){
    document.getElementById("week0_quiz").value = '';
    document.getElementById("week0_score").value = '';    
    document.getElementById("week4_quiz").value = '';
    document.getElementById("week4_score").value = ''; 
  }
  else if(selectNum == 1){    
    document.getElementById("week0_quiz").value = '';
    document.getElementById("week0_score").value =  '';
    document.getElementById("week4_quiz").value = '[{"題目":"1.我能感覺到自己的喜怒哀樂。","正面負面":"positive","向度":"情緒覺察"},{"題目":"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。","正面負面":"positive","向度":"情緒覺察"},{"題目":"3.我知道什麼事情會使自己害怕。","正面負面":"positive","向度":"情緒覺察"},{"題目":"4.我會思考過去情緒表達不適合的地方。","正面負面":"positive","向度":"自我反省"},{"題目":"5.我會主動反省自己的情緒表達好不好。","正面負面":"positive","向度":"自我反省"},{"題目":"6.我亂發脾氣時，事後會很後悔。","正面負面":"positive","向度":"自我反省"},{"題目":"7.我會在沮喪時，嘗試想像生活中愉快的事。","正面負面":"positive","向度":"自我激勵"},{"題目":"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。","正面負面":"positive","向度":"自我激勵"},{"題目":"9.我會在遇到困難時，往好的方向去想。","正面負面":"positive","向度":"自我激勵"},{"題目":"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。","正面負面":"positive","向度":"尋求資源"},{"題目":"11.我在學校遇到困難時，會請老師或朋友幫助我。","正面負面":"positive","向度":"尋求資源"},{"題目":"12.我會用說的、寫的或是肢體動作來表達自己的情緒。","正面負面":"positive","向度":"尋求資源"},{"題目":"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。","正面負面":"positive","向度":"同理他人"},{"題目":"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。","正面負面":"positive","向度":"同理他人"},{"題目":"15.我為了更好地理解同學，會試圖從同學的角度看事情。","正面負面":"positive","向度":"同理他人"},{"題目":"16.我和同學相處融洽。","正面負面":"positive","向度":"同儕關係"},{"題目":"17.我喜歡跟朋友玩。","正面負面":"positive","向度":"同儕關係"},{"題目":"18.我有信任的同學。","正面負面":"positive","向度":"同儕關係"},{"題目":"19.我會主動幫助同學。","正面負面":"positive","向度":"同儕互動"},{"題目":"20.我會讚美同學。","正面負面":"positive","向度":"同儕互動"},{"題目":"21.我能夠與朋友分享。","正面負面":"positive","向度":"同儕互動"},{"題目":"22.我會在同學心情不好的時候，安慰他。","正面負面":"positive","向度":"危機因應"},{"題目":"23.我會在和同學有爭吵時，冷靜思考發生的原因。","正面負面":"positive","向度":"危機因應"},{"題目":"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。","正面負面":"positive","向度":"危機因應"}]';
    document.getElementById("week4_score").value = '[{"姓名":"陳芝瑜","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":2,"3.我知道什麼事情會使自己害怕。":4,"4.我會思考過去情緒表達不適合的地方。":1,"5.我會主動反省自己的情緒表達好不好。":1,"6.我亂發脾氣時，事後會很後悔。":1,"7.我會在沮喪時，嘗試想像生活中愉快的事。":3,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":3,"9.我會在遇到困難時，往好的方向去想。":1,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":4,"11.我在學校遇到困難時，會請老師或朋友幫助我。":2,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":2,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":2,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":2,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":2,"16.我和同學相處融洽。":2,"17.我喜歡跟朋友玩。":3,"18.我有信任的同學。":2,"19.我會主動幫助同學。":2,"20.我會讚美同學。":2,"21.我能夠與朋友分享。":3,"22.我會在同學心情不好的時候，安慰他。":2,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":2,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":2},{"姓名":"李虎","1.我能感覺到自己的喜怒哀樂。":2,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":1,"3.我知道什麼事情會使自己害怕。":1,"4.我會思考過去情緒表達不適合的地方。":2,"5.我會主動反省自己的情緒表達好不好。":2,"6.我亂發脾氣時，事後會很後悔。":2,"7.我會在沮喪時，嘗試想像生活中愉快的事。":2,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":2,"9.我會在遇到困難時，往好的方向去想。":1,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":3,"11.我在學校遇到困難時，會請老師或朋友幫助我。":2,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":1,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":2,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":1,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":1,"16.我和同學相處融洽。":2,"17.我喜歡跟朋友玩。":2,"18.我有信任的同學。":2,"19.我會主動幫助同學。":2,"20.我會讚美同學。":2,"21.我能夠與朋友分享。":2,"22.我會在同學心情不好的時候，安慰他。":2,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":1,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":3},{"姓名":"林書恆","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":2,"3.我知道什麼事情會使自己害怕。":1,"4.我會思考過去情緒表達不適合的地方。":2,"5.我會主動反省自己的情緒表達好不好。":2,"6.我亂發脾氣時，事後會很後悔。":2,"7.我會在沮喪時，嘗試想像生活中愉快的事。":1,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":1,"9.我會在遇到困難時，往好的方向去想。":1,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":4,"11.我在學校遇到困難時，會請老師或朋友幫助我。":1,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":3,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":4,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":4,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":3,"16.我和同學相處融洽。":2,"17.我喜歡跟朋友玩。":1,"18.我有信任的同學。":1,"19.我會主動幫助同學。":2,"20.我會讚美同學。":3,"21.我能夠與朋友分享。":1,"22.我會在同學心情不好的時候，安慰他。":2,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":3,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":3},{"姓名":"陳品承","1.我能感覺到自己的喜怒哀樂。":3,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":3,"3.我知道什麼事情會使自己害怕。":1,"4.我會思考過去情緒表達不適合的地方。":3,"5.我會主動反省自己的情緒表達好不好。":2,"6.我亂發脾氣時，事後會很後悔。":3,"7.我會在沮喪時，嘗試想像生活中愉快的事。":1,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":1,"9.我會在遇到困難時，往好的方向去想。":1,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":1,"11.我在學校遇到困難時，會請老師或朋友幫助我。":2,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":4,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":4,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":3,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":1,"16.我和同學相處融洽。":3,"17.我喜歡跟朋友玩。":4,"18.我有信任的同學。":4,"19.我會主動幫助同學。":3,"20.我會讚美同學。":3,"21.我能夠與朋友分享。":3,"22.我會在同學心情不好的時候，安慰他。":4,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":2,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":4},{"姓名":"謝伊林","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":4,"3.我知道什麼事情會使自己害怕。":4,"4.我會思考過去情緒表達不適合的地方。":4,"5.我會主動反省自己的情緒表達好不好。":2,"6.我亂發脾氣時，事後會很後悔。":4,"7.我會在沮喪時，嘗試想像生活中愉快的事。":4,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":4,"9.我會在遇到困難時，往好的方向去想。":3,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":4,"11.我在學校遇到困難時，會請老師或朋友幫助我。":4,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":2,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":4,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":4,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":4,"16.我和同學相處融洽。":3,"17.我喜歡跟朋友玩。":4,"18.我有信任的同學。":4,"19.我會主動幫助同學。":4,"20.我會讚美同學。":4,"21.我能夠與朋友分享。":4,"22.我會在同學心情不好的時候，安慰他。":4,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":2,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":3},{"姓名":"林瑀彤","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":3,"3.我知道什麼事情會使自己害怕。":3,"4.我會思考過去情緒表達不適合的地方。":2,"5.我會主動反省自己的情緒表達好不好。":2,"6.我亂發脾氣時，事後會很後悔。":2,"7.我會在沮喪時，嘗試想像生活中愉快的事。":2,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":2,"9.我會在遇到困難時，往好的方向去想。":1,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":3,"11.我在學校遇到困難時，會請老師或朋友幫助我。":2,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":3,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":3,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":2,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":2,"16.我和同學相處融洽。":3,"17.我喜歡跟朋友玩。":4,"18.我有信任的同學。":4,"19.我會主動幫助同學。":3,"20.我會讚美同學。":2,"21.我能夠與朋友分享。":3,"22.我會在同學心情不好的時候，安慰他。":2,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":3,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":4},{"姓名":"林昱薰","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":4,"3.我知道什麼事情會使自己害怕。":4,"4.我會思考過去情緒表達不適合的地方。":3,"5.我會主動反省自己的情緒表達好不好。":2,"6.我亂發脾氣時，事後會很後悔。":1,"7.我會在沮喪時，嘗試想像生活中愉快的事。":1,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":1,"9.我會在遇到困難時，往好的方向去想。":1,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":4,"11.我在學校遇到困難時，會請老師或朋友幫助我。":2,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":1,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":1,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":1,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":2,"16.我和同學相處融洽。":4,"17.我喜歡跟朋友玩。":4,"18.我有信任的同學。":4,"19.我會主動幫助同學。":2,"20.我會讚美同學。":2,"21.我能夠與朋友分享。":4,"22.我會在同學心情不好的時候，安慰他。":4,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":1,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":1},{"姓名":"李宜庭","1.我能感覺到自己的喜怒哀樂。":2,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":3,"3.我知道什麼事情會使自己害怕。":1,"4.我會思考過去情緒表達不適合的地方。":2,"5.我會主動反省自己的情緒表達好不好。":1,"6.我亂發脾氣時，事後會很後悔。":1,"7.我會在沮喪時，嘗試想像生活中愉快的事。":1,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":1,"9.我會在遇到困難時，往好的方向去想。":1,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":1,"11.我在學校遇到困難時，會請老師或朋友幫助我。":1,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":1,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":2,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":1,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":1,"16.我和同學相處融洽。":3,"17.我喜歡跟朋友玩。":3,"18.我有信任的同學。":3,"19.我會主動幫助同學。":2,"20.我會讚美同學。":1,"21.我能夠與朋友分享。":2,"22.我會在同學心情不好的時候，安慰他。":1,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":1,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":4},{"姓名":"何沛玟","1.我能感覺到自己的喜怒哀樂。":2,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":1,"3.我知道什麼事情會使自己害怕。":3,"4.我會思考過去情緒表達不適合的地方。":2,"5.我會主動反省自己的情緒表達好不好。":2,"6.我亂發脾氣時，事後會很後悔。":1,"7.我會在沮喪時，嘗試想像生活中愉快的事。":3,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":3,"9.我會在遇到困難時，往好的方向去想。":2,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":3,"11.我在學校遇到困難時，會請老師或朋友幫助我。":3,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":2,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":2,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":2,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":2,"16.我和同學相處融洽。":2,"17.我喜歡跟朋友玩。":2,"18.我有信任的同學。":1,"19.我會主動幫助同學。":3,"20.我會讚美同學。":1,"21.我能夠與朋友分享。":3,"22.我會在同學心情不好的時候，安慰他。":2,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":2,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":2},{"姓名":"蕭睿彤","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":4,"3.我知道什麼事情會使自己害怕。":4,"4.我會思考過去情緒表達不適合的地方。":3,"5.我會主動反省自己的情緒表達好不好。":3,"6.我亂發脾氣時，事後會很後悔。":3,"7.我會在沮喪時，嘗試想像生活中愉快的事。":2,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":2,"9.我會在遇到困難時，往好的方向去想。":2,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":3,"11.我在學校遇到困難時，會請老師或朋友幫助我。":1,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":4,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":4,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":4,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":3,"16.我和同學相處融洽。":3,"17.我喜歡跟朋友玩。":4,"18.我有信任的同學。":4,"19.我會主動幫助同學。":3,"20.我會讚美同學。":2,"21.我能夠與朋友分享。":3,"22.我會在同學心情不好的時候，安慰他。":4,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":2,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":2},{"姓名":"楊凱喆","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":4,"3.我知道什麼事情會使自己害怕。":4,"4.我會思考過去情緒表達不適合的地方。":3,"5.我會主動反省自己的情緒表達好不好。":3,"6.我亂發脾氣時，事後會很後悔。":3,"7.我會在沮喪時，嘗試想像生活中愉快的事。":2,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":2,"9.我會在遇到困難時，往好的方向去想。":2,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":3,"11.我在學校遇到困難時，會請老師或朋友幫助我。":3,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":3,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":2,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":2,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":2,"16.我和同學相處融洽。":2,"17.我喜歡跟朋友玩。":3,"18.我有信任的同學。":3,"19.我會主動幫助同學。":3,"20.我會讚美同學。":2,"21.我能夠與朋友分享。":3,"22.我會在同學心情不好的時候，安慰他。":3,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":1,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":2},{"姓名":"程定凡","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":3,"3.我知道什麼事情會使自己害怕。":4,"4.我會思考過去情緒表達不適合的地方。":4,"5.我會主動反省自己的情緒表達好不好。":4,"6.我亂發脾氣時，事後會很後悔。":3,"7.我會在沮喪時，嘗試想像生活中愉快的事。":4,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":4,"9.我會在遇到困難時，往好的方向去想。":4,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":3,"11.我在學校遇到困難時，會請老師或朋友幫助我。":2,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":2,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":3,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":3,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":2,"16.我和同學相處融洽。":1,"17.我喜歡跟朋友玩。":1,"18.我有信任的同學。":1,"19.我會主動幫助同學。":1,"20.我會讚美同學。":1,"21.我能夠與朋友分享。":1,"22.我會在同學心情不好的時候，安慰他。":3,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":1,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":3},{"姓名":"劉茗洋","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":4,"3.我知道什麼事情會使自己害怕。":3,"4.我會思考過去情緒表達不適合的地方。":1,"5.我會主動反省自己的情緒表達好不好。":1,"6.我亂發脾氣時，事後會很後悔。":1,"7.我會在沮喪時，嘗試想像生活中愉快的事。":1,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":3,"9.我會在遇到困難時，往好的方向去想。":4,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":3,"11.我在學校遇到困難時，會請老師或朋友幫助我。":3,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":2,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":4,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":3,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":3,"16.我和同學相處融洽。":4,"17.我喜歡跟朋友玩。":4,"18.我有信任的同學。":3,"19.我會主動幫助同學。":4,"20.我會讚美同學。":3,"21.我能夠與朋友分享。":3,"22.我會在同學心情不好的時候，安慰他。":2,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":4,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":3},{"姓名":"林芮妤","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":4,"3.我知道什麼事情會使自己害怕。":4,"4.我會思考過去情緒表達不適合的地方。":2,"5.我會主動反省自己的情緒表達好不好。":2,"6.我亂發脾氣時，事後會很後悔。":4,"7.我會在沮喪時，嘗試想像生活中愉快的事。":3,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":3,"9.我會在遇到困難時，往好的方向去想。":3,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":2,"11.我在學校遇到困難時，會請老師或朋友幫助我。":3,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":3,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":4,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":2,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":2,"16.我和同學相處融洽。":3,"17.我喜歡跟朋友玩。":4,"18.我有信任的同學。":4,"19.我會主動幫助同學。":3,"20.我會讚美同學。":3,"21.我能夠與朋友分享。":4,"22.我會在同學心情不好的時候，安慰他。":4,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":2,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":3},{"姓名":"陳瑞昇","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":2,"3.我知道什麼事情會使自己害怕。":4,"4.我會思考過去情緒表達不適合的地方。":1,"5.我會主動反省自己的情緒表達好不好。":2,"6.我亂發脾氣時，事後會很後悔。":1,"7.我會在沮喪時，嘗試想像生活中愉快的事。":3,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":3,"9.我會在遇到困難時，往好的方向去想。":2,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":4,"11.我在學校遇到困難時，會請老師或朋友幫助我。":3,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":4,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":4,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":4,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":3,"16.我和同學相處融洽。":3,"17.我喜歡跟朋友玩。":3,"18.我有信任的同學。":4,"19.我會主動幫助同學。":4,"20.我會讚美同學。":1,"21.我能夠與朋友分享。":3,"22.我會在同學心情不好的時候，安慰他。":4,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":1,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":4},{"姓名":"廖靖恩","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":4,"3.我知道什麼事情會使自己害怕。":4,"4.我會思考過去情緒表達不適合的地方。":4,"5.我會主動反省自己的情緒表達好不好。":3,"6.我亂發脾氣時，事後會很後悔。":2,"7.我會在沮喪時，嘗試想像生活中愉快的事。":3,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":2,"9.我會在遇到困難時，往好的方向去想。":3,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":3,"11.我在學校遇到困難時，會請老師或朋友幫助我。":3,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":4,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":4,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":2,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":3,"16.我和同學相處融洽。":4,"17.我喜歡跟朋友玩。":4,"18.我有信任的同學。":4,"19.我會主動幫助同學。":4,"20.我會讚美同學。":4,"21.我能夠與朋友分享。":3,"22.我會在同學心情不好的時候，安慰他。":2,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":3,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":4},{"姓名":"余悅安","1.我能感覺到自己的喜怒哀樂。":4,"2.我知道當自己高興、生氣、緊張時，自己為什麼高興、生氣、緊張。":3,"3.我知道什麼事情會使自己害怕。":4,"4.我會思考過去情緒表達不適合的地方。":3,"5.我會主動反省自己的情緒表達好不好。":3,"6.我亂發脾氣時，事後會很後悔。":3,"7.我會在沮喪時，嘗試想像生活中愉快的事。":3,"8.我在遇到不如意的事情時，會想一些快樂的事，讓自己心情好一點。":2,"9.我會在遇到困難時，往好的方向去想。":2,"10.我會在遇到會緊張的事情時，做些活動(例如聽音樂)，讓自己不那麼緊張。":1,"11.我在學校遇到困難時，會請老師或朋友幫助我。":1,"12.我會用說的、寫的或是肢體動作來表達自己的情緒。":3,"13.我可以從他人的表情、說話語調，知道他的心情是怎樣的。":4,"14.我可以在別人經驗的事情中，知道別人現在的心情起伏是什麼。":4,"15.我為了更好地理解同學，會試圖從同學的角度看事情。":3,"16.我和同學相處融洽。":4,"17.我喜歡跟朋友玩。":4,"18.我有信任的同學。":4,"19.我會主動幫助同學。":3,"20.我會讚美同學。":3,"21.我能夠與朋友分享。":4,"22.我會在同學心情不好的時候，安慰他。":2,"23.我會在和同學有爭吵時，冷靜思考發生的原因。":3,"24.我會在執行家族任務遇到組員有衝突時，試著協調組員。":4}]'; 
  }
  else if(selectNum == 2){    
    document.getElementById("week0_quiz").value = '[{"題目":"1.受同學取笑欺負時，會生氣予以反擊","正面負面":"negative","向度":"衝突處理"},{"題目":"2.會盡力完成被分配到的工作","正面負面":"positive","向度":"自我激勵"},{"題目":"3.對現在的自己感到滿意","正面負面":"positive","向度":"自我接納"},{"題目":"4.能正確地表達出自己的情緒","正面負面":"positive","向度":"自我情緒覺察"},{"題目":"5.發脾氣後會感到懊悔","正面負面":"positive","向度":"自我反省"},{"題目":"6.不習慣在不熟的人面前說話","正面負面":"negative","向度":"生活壓力"},{"題目":"7.不好的情緒產生時能積極面對","正面負面":"positive","向度":"情緒管理"},{"題目":"8.能用運動、聽音樂等休閒方式調整自己的心情","正面負面":"positive","向度":"壓力抒發"}]';
    document.getElementById("week0_score").value = '[{"Timestamp":"12/20/2018 8:43:50","學號":80101,"姓名":"劉德華","1.受同學取笑欺負時，會生氣予以反擊":1,"2.會盡力完成被分配到的工作":5,"3.對現在的自己感到滿意":5,"4.能正確地表達出自己的情緒":4,"5.發脾氣後會感到懊悔":5,"6.不習慣在不熟的人面前說話":2,"7.不好的情緒產生時能積極面對":4,"8.能用運動、聽音樂等休閒方式調整自己的心情":5},{"Timestamp":"12/20/2018 8:44:27","學號":80102,"姓名":"張學友","1.受同學取笑欺負時，會生氣予以反擊":5,"2.會盡力完成被分配到的工作":2,"3.對現在的自己感到滿意":4,"4.能正確地表達出自己的情緒":2,"5.發脾氣後會感到懊悔":5,"6.不習慣在不熟的人面前說話":4,"7.不好的情緒產生時能積極面對":2,"8.能用運動、聽音樂等休閒方式調整自己的心情":3},{"Timestamp":"12/20/2018 8:45:55","學號":80103,"姓名":"郭富城","1.受同學取笑欺負時，會生氣予以反擊":3,"2.會盡力完成被分配到的工作":3,"3.對現在的自己感到滿意":2,"4.能正確地表達出自己的情緒":2,"5.發脾氣後會感到懊悔":3,"6.不習慣在不熟的人面前說話":5,"7.不好的情緒產生時能積極面對":2,"8.能用運動、聽音樂等休閒方式調整自己的心情":2}]';    
    document.getElementById("week4_quiz").value = '[{"題目":"1.同學取笑我、欺負我的時候，我會生氣罵回去","正面負面":"negative","向度":"衝突處理"},{"題目":"2.我會盡力完成被分配到的工作","正面負面":"positive","向度":"自我激勵"},{"題目":"3.我對現在的自己感到滿意","正面負面":"positive","向度":"自我接納"},{"題目":"4.我能夠正確地表達出自己的情緒。","正面負面":"positive","向度":"自我情緒覺察"},{"題目":"5.我如果隨便亂發脾氣，事後會很後悔","正面負面":"positive","向度":"自我反省"},{"題目":"6.在不認識的人面前說話，讓我很有壓力","正面負面":"negative","向度":"生活壓力"},{"題目":"7.當我產生不好的情緒時，能積極面對不逃避","正面負面":"positive","向度":"情緒管理"},{"題目":"8.當心情不好時，我會用運動、散步、聽音樂或玩手機等方式讓心情變好","正面負面":"positive","向度":"壓力抒發"}]';
    document.getElementById("week4_score").value = '[{"Timestamp":"12/20/2018 8:47:09","學號":80101,"姓名":"劉德華","1.同學取笑我、欺負我的時候，我會生氣罵回去":2,"2.我會盡力完成被分配到的工作":5,"3.我對現在的自己感到滿意":1,"4.我能夠正確地表達出自己的情緒。":4,"5.我如果隨便亂發脾氣，事後會很後悔":5,"6.在不認識的人面前說話，讓我很有壓力":1,"7.當我產生不好的情緒時，能積極面對不逃避":4,"8.當心情不好時，我會用運動、散步、聽音樂或玩手機等方式讓心情變好":5},{"Timestamp":"12/20/2018 8:47:38","學號":80102,"姓名":"張學友","1.同學取笑我、欺負我的時候，我會生氣罵回去":2,"2.我會盡力完成被分配到的工作":3,"3.我對現在的自己感到滿意":3,"4.我能夠正確地表達出自己的情緒。":2,"5.我如果隨便亂發脾氣，事後會很後悔":4,"6.在不認識的人面前說話，讓我很有壓力":2,"7.當我產生不好的情緒時，能積極面對不逃避":3,"8.當心情不好時，我會用運動、散步、聽音樂或玩手機等方式讓心情變好":3},{"Timestamp":"12/20/2018 8:48:06","學號":80103,"姓名":"郭富城","1.同學取笑我、欺負我的時候，我會生氣罵回去":5,"2.我會盡力完成被分配到的工作":2,"3.我對現在的自己感到滿意":1,"4.我能夠正確地表達出自己的情緒。":2,"5.我如果隨便亂發脾氣，事後會很後悔":4,"6.在不認識的人面前說話，讓我很有壓力":5,"7.當我產生不好的情緒時，能積極面對不逃避":2,"8.當心情不好時，我會用運動、散步、聽音樂或玩手機等方式讓心情變好":2}]'; 
  }
  else if(selectNum == 3){    
    document.getElementById("week0_quiz").value = '[{"題目":"1.覺得同學不能接納他","正面負面":"negative","向度":"同理他人"},{"題目":"2.在團體中屬於比較沉默的學生","正面負面":"negative","向度":"同儕相處"},{"題目":"3.會跟同儕分享心裡的想法","正面負面":"positive","向度":"同儕合作"},{"題目":"4.當遇到困難時，會嘗試看書本找出解決之道","正面負面":"positive","向度":"參照經驗"}]';
    document.getElementById("week0_score").value = '[{"Timestamp":"12/14/2018 15:27:37","學號":70101,"姓名":"王小華","1.覺得同學不能接納他":5,"2.在團體中屬於比較沉默的學生":4,"3.會跟同儕分享心裡的想法":3,"4.當遇到困難時，會嘗試看書本找出解決之道":3},{"Timestamp":"12/14/2018 15:49:03","學號":70102,"姓名":"張大華","1.覺得同學不能接納他":3,"2.在團體中屬於比較沉默的學生":2,"3.會跟同儕分享心裡的想法":1,"4.當遇到困難時，會嘗試看書本找出解決之道":1},{"Timestamp":"12/14/2018 15:49:29","學號":70103,"姓名":"李小花","1.覺得同學不能接納他":5,"2.在團體中屬於比較沉默的學生":5,"3.會跟同儕分享心裡的想法":4,"4.當遇到困難時，會嘗試看書本找出解決之道":1},{"Timestamp":"12/14/2018 15:50:01","學號":70104,"姓名":"林大玲","1.覺得同學不能接納他":2,"2.在團體中屬於比較沉默的學生":1,"3.會跟同儕分享心裡的想法":4,"4.當遇到困難時，會嘗試看書本找出解決之道":1},{"Timestamp":"12/14/2018 15:50:30","學號":70105,"姓名":"陳筱英","1.覺得同學不能接納他":2,"2.在團體中屬於比較沉默的學生":4,"3.會跟同儕分享心裡的想法":5,"4.當遇到困難時，會嘗試看書本找出解決之道":1}]'; 
    document.getElementById("week4_quiz").value = '[{"題目":"2.當我遇到困難時，我會試著從書本中找出解決的方法","正面負面":"positive","向度":"參照經驗"},{"題目":"3.我會跟同學分享心裡的想法","正面負面":"positive","向度":"同儕合作"},{"題目":"4.與別人相處時，我是屬於比較沉默的一方","正面負面":"negative","向度":"同儕相處"},{"題目":"5.我覺得同學不喜歡我","正面負面":"negative","向度":"同理他人"}]';
    document.getElementById("week4_score").value = '[{"Timestamp":"12/14/2018 15:27:37","學號":70101,"姓名":"王小華","2.當我遇到困難時，我會試著從書本中找出解決的方法":4,"3.我會跟同學分享心裡的想法":3,"4.與別人相處時，我是屬於比較沉默的一方":3,"5.我覺得同學不喜歡我":2},{"Timestamp":"12/14/2018 15:49:03","學號":70102,"姓名":"張大華","2.當我遇到困難時，我會試著從書本中找出解決的方法":2,"3.我會跟同學分享心裡的想法":1,"4.與別人相處時，我是屬於比較沉默的一方":1,"5.我覺得同學不喜歡我":3},{"Timestamp":"12/14/2018 15:49:29","學號":70103,"姓名":"李小花","2.當我遇到困難時，我會試著從書本中找出解決的方法":5,"3.我會跟同學分享心裡的想法":4,"4.與別人相處時，我是屬於比較沉默的一方":1,"5.我覺得同學不喜歡我":1},{"Timestamp":"12/14/2018 15:50:01","學號":70104,"姓名":"林大玲","2.當我遇到困難時，我會試著從書本中找出解決的方法":1,"3.我會跟同學分享心裡的想法":4,"4.與別人相處時，我是屬於比較沉默的一方":1,"5.我覺得同學不喜歡我":2},{"Timestamp":"12/14/2018 15:50:30","學號":70105,"姓名":"陳筱英","2.當我遇到困難時，我會試著從書本中找出解決的方法":4,"3.我會跟同學分享心裡的想法":5,"4.與別人相處時，我是屬於比較沉默的一方":1,"5.我覺得同學不喜歡我":1}]';        
  }
}
function checkDuplicateID() {
  // Warning Duplicate IDs
  $('[id]').each(function() {
      let ids = $('[id="' + this.id + '"]');
      if (ids.length > 1 && ids[0] == this)
          console.warn('Multiple IDs #' + this.id);
  });
}
$(document).ready(function (e) {
  // Debug
  checkDuplicateID();
  //$("#ClickMEE2").click();
  //$("#ClickMEE").click();
  $("div a[href='#main-body']").on('click', function (event) {
    if (this.hash !== "") {
      event.preventDefault();
      var hash = this.hash;$('html, body').animate({
        scrollTop: $(hash).offset().top
      }, 900, function () {
        window.location.hash = hash;
      });
    }
  });
});
$(window).on('load', function (e) {
})